# 1. Найдите сумму цифр трехзначного числа n.

n = 123
res = n % 10 + ((n - (n % 10)) //10) % 10 + n // 100
print(res)