# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.

n = 6
x = n / 6
y = 2 * (x + x)
z = x
print(int(x),int(y),int(z))